// Функция ymaps.ready() будет вызвана, когда
// загрузятся все компоненты API, а также когда будет готово DOM-дерево.
ymaps.ready(init);

function init() {
    // Создание карты.
    // https://tech.yandex.ru/maps/doc/jsapi/2.1/dg/concepts/map-docpage/
    var myMap = new ymaps.Map("map", {
        // Координаты центра карты.
        // Порядок по умолчнию: «широта, долгота».
        center: [55.772274, 49.145922],
        // Уровень масштабирования. Допустимые значения:
        // от 0 (весь мир) до 19.
        zoom: 16,
        suppressMapOpenBlock: true,
        // Элементы управления
        // https://tech.yandex.ru/maps/doc/jsapi/2.1/dg/concepts/controls/standard-docpage/
        controls: []
    }, {
        suppressMapOpenBlock: true
    });

    // Добавление метки
    // https://tech.yandex.ru/maps/doc/jsapi/2.1/ref/reference/Placemark-docpage/
    var myPlacemark = new ymaps.Placemark([55.772274, 49.145922], {
        // Хинт показывается при наведении мышкой на иконку метки.
        hintContent: 'Спартаковская улица, 123',
        // Балун откроется при клике по метке.
        balloonContent: 'Спартаковская улица, 123'
    }, {
        // Опции.
        // Необходимо указать данный тип макета.
        iconLayout: 'default#image',
        // Своё изображение иконки метки.
        iconImageHref: "data:image/svg+xml,%3Csvg width='45' height='59' viewBox='0 0 45 59' fill='none' xmlns='http://www.w3.org/2000/svg'%3E%3Cpath d='M22.5 1.46875C16.7813 1.46876 11.2968 3.74053 7.25303 7.78428C3.20928 11.828 0.937514 17.3125 0.9375 23.0312C0.9375 42.4375 22.5 57.5312 22.5 57.5312C22.5 57.5312 44.0625 42.4375 44.0625 23.0312C44.0625 17.3125 41.7907 11.828 37.747 7.78428C33.7032 3.74053 28.2187 1.46876 22.5 1.46875ZM22.5 31.6562C20.7941 31.6562 19.1266 31.1504 17.7082 30.2027C16.2898 29.2549 15.1843 27.9079 14.5315 26.3319C13.8787 24.7559 13.7079 23.0217 14.0407 21.3486C14.3735 19.6755 15.195 18.1387 16.4012 16.9325C17.6074 15.7262 19.1443 14.9048 20.8173 14.572C22.4904 14.2392 24.2246 14.41 25.8006 15.0628C27.3767 15.7156 28.7237 16.8211 29.6714 18.2395C30.6192 19.6578 31.125 21.3254 31.125 23.0312C31.125 25.3187 30.2163 27.5125 28.5988 29.13C26.9813 30.7475 24.7875 31.6562 22.5 31.6562Z' fill='%23808080'/%3E%3Cpath fill-rule='evenodd' clip-rule='evenodd' d='M22.5 14.9062C18.0127 14.9062 14.375 18.5439 14.375 23.0312C14.375 27.5186 18.0127 31.1562 22.5 31.1562C26.9873 31.1562 30.625 27.5186 30.625 23.0312C30.625 18.5439 26.9873 14.9062 22.5 14.9062ZM13.375 23.0312C13.375 17.9917 17.4604 13.9062 22.5 13.9062C27.5396 13.9062 31.625 17.9917 31.625 23.0312C31.625 28.0708 27.5396 32.1562 22.5 32.1562C17.4604 32.1562 13.375 28.0708 13.375 23.0312Z' fill='black'/%3E%3Cpath fill-rule='evenodd' clip-rule='evenodd' d='M22.5 1.96875C16.9139 1.96875 11.5565 4.18783 7.60656 8.13781C3.65658 12.0878 1.4375 17.4451 1.4375 23.0312C1.4375 32.5543 6.73405 41.0642 12.0961 47.2305C14.7709 50.3066 17.4471 52.7822 19.4547 54.4887C20.4581 55.3416 21.2936 56.0016 21.8771 56.4475C22.1374 56.6465 22.3475 56.8028 22.5 56.9146C22.6524 56.8028 22.8626 56.6465 23.1229 56.4475C23.7064 56.0016 24.5419 55.3416 25.5453 54.4887C27.5529 52.7822 30.229 50.3066 32.9039 47.2305C38.266 41.0642 43.5625 32.5543 43.5625 23.0312C43.5625 17.4451 41.3434 12.0878 37.3934 8.13781C33.4435 4.18783 28.0861 1.96875 22.5 1.96875ZM22.5 57.5312C22.2133 57.9409 22.2131 57.9407 22.2128 57.9405L22.2084 57.9374L22.1957 57.9285L22.1475 57.8942C22.1053 57.8641 22.0434 57.8195 21.963 57.7608C21.8023 57.6435 21.5677 57.4697 21.2699 57.242C20.6742 56.7868 19.8251 56.1159 18.807 55.2506C16.7716 53.5205 14.0572 51.0098 11.3414 47.8867C5.9222 41.6545 0.4375 32.9144 0.4375 23.0312C0.4375 17.1799 2.76194 11.5682 6.89946 7.43071C11.037 3.29319 16.6487 0.96875 22.5 0.96875C28.3513 0.96875 33.963 3.29319 38.1005 7.43071C42.2381 11.5682 44.5625 17.1799 44.5625 23.0312C44.5625 32.9144 39.0778 41.6545 33.6586 47.8867C30.9428 51.0098 28.2284 53.5205 26.193 55.2506C25.1749 56.1159 24.3258 56.7868 23.7301 57.242C23.4323 57.4697 23.1977 57.6435 23.037 57.7608C22.9566 57.8195 22.8947 57.8641 22.8525 57.8942L22.8043 57.9285L22.7916 57.9374L22.7872 57.9405C22.7869 57.9407 22.7867 57.9409 22.5 57.5312ZM22.5 57.5312L22.7872 57.9405C22.6151 58.061 22.3849 58.061 22.2128 57.9405L22.5 57.5312Z' fill='black'/%3E%3C/svg%3E%0A",
        // Размеры метки.
        iconImageSize: [44, 56],
        // Смещение левого верхнего угла иконки относительно
        // её "ножки" (точки привязки).
        iconImageOffset: [-5, -38]
    });

    // После того как метка была создана, добавляем её на карту.
    myMap.geoObjects.add(myPlacemark);
    myMap.behaviors.disable('scrollZoom');

}